#Визначте середнє значення всіх елементів послідовності,
# яка завершується числом 0. Вводиться послідовність цілих чисел,
# що закінчується числом 0 (саме число 0 в послідовність не входить,
# а використовується як ознака її закінчення).

# Сюди ми складаємо всі - всі цифри
num_res = 0
# А тут рахуємо кроки
num_step = 0
# Цикл while безкінечний бо має True
while True:
    # Тут ми вводимо наші значення в int - цифри без дробі
    num_input = int(input("Значення: "))
    # Тут у нас умова, ввод не повинен бути 0
    if num_input != 0:
        # Додаємо значення до num_res: num_res = num_res + num_input
        num_res += num_input
        # Додаємо крок до наших кроків: num_step = num_step + 1
        num_step += 1
    # А якщо все ж 0, то виконуємо else
    else:
        # просто друкуємо кількість елементів, та наше середнє яке усі значення / кроки
        print(f"Усього значень - {num_step}\nСереднє - {(num_res/num_step):.10f}")
        # Виход з while безкінечного
        break
