# Скільки створити автівок на початку
START = 1

# Назва файлу для збереження змінної
SAVE_FILE = "SAVE"

# Курс $
USD = 29.55  # Курс на 24.06.2022

# Ім'я
NAME = "Дмитро"

# Пошта
EMAIL = "Dmitro@mail.ua"

# Модель
MODEL = "UA Edition"

# Опис
DESCRIPTION = "Гарне авто"

# Міста
CITY = ["Київ", "Харків", "Одеса", "Дніпро", "Донецьк", "Запоріжжя", "Львів", "Кривий Ріг", "Миколаїв",
        "Маріуполь", "Луганськ", "Севастополь", "Вінниця", "Макіївка", "Сімферополь", "Херсон", "Полтава",
        "Чернігів", "Черкаси", "Суми", "Житомир", "Хмельницький", "Чернівці", "Горлівка", "Рівне",
        "Дніпродзержинськ", "Кіровоград", "Івано-Франківськ", "Кременчук", "Тернопіль", "Луцьк",
        "Біла Церква", "Краматорськ", "Мелітополь", "Керч", "Сєвєродонецьк", "Червоний Луч", "Нікополь",
        "Бердянськ", "Слов'янськ", "Ужгород", "Алчевськ", "Павлоград", "Євпаторія", "Лисичанськ",
        "Кам'янець-Подільський", "Бровари", "Дрогобич", "Стаханов", "Конотоп", "Ровеньки", "Умань",
        "Мукачево", "Червоноград", "Олександрія", "Єнакієве", "Бердичів", "Шостка", "Артемівськ",
        "Ялта", "Костянтинівка", "Іллічівськ", "Краснодон", "Ізмаїл", "Ніжин", "Лозова", "Новомосковськ",
        "Нова Каховка", "Ковель", "Феодосія", "Сміла", "Калуш", "Первомайськ", "Коростень", "Свердловськ",
        "Красноармійськ", "Коломия", "Бориспіль", "Стрий", "Рубіжне", "Дружківка", "Прилуки", "Харцизьк",
        "Нововолинськ", "Білгород-Дністровський", "Новоград-Волинський", "Торез", "Антрацит", "Брянка",
        "Енергодар", "Комсомольськ", "Ізюм", "Фастів", "Вишневе", "Димитров", "Шахтарськ", "Охтирка",
        "Марганець", "Котовськ", "Лубни", "Сніжне", "Жовті Води", "Світловодськ", "Шепетівка", "Ромни",
        "Буча", "Орджонікідзе", "Кузнецовськ", "Миргород", "Коростишів", "Южноукраїнськ", "Васильків",
        "Ірпінь", "Володимир-Волинський", "Первомайськ", "Джанкой", "Дубно", "Каховка", "Борислав",
        "Боярка", "Нетішин", "Вознесенськ", "Чугуїв", "Славута", "Жмеринка", "Ясинувата", "Самбір",
        "Новопсков", "Старокостянтинів", "Глухів", "Авдіївка", "Дзержинськ", "Обухів", "Токмак",
        "Первомайський", "Балаклія", "Могилів-Подільський", "Південне", "Хуст", "Синельникове",
        "Куп'янськ", "Добропілля", "Костопіль", "Здолбунів", "Переяслав-Хмельницький", "Трускавець",
        "Алушта", "Першотравенськ", "Жашків", "Тернівка", "Чортків", "Новий Розділ", "Сарни", "Красилів",
        "Золотоноша", "Хмільник", "Кіровське", "Виноградов", "Бахчисарай", "Вишгород", "Малин", "Красноперекопськ",
        "Лебедин", "Перевальськ", "Гайсин", "Канів", "Генічеськ", "Славутич", "Волочиськ", "Цюрупинськ", "Саки",
        "Дебальцеве", "Мерефа", "Козятин", "Кролевець", "Берегово", "Молодогвардійськ", "Золочів", "Люботин",
        "Селидове", "Знам'янка", "Вільногірськ", "Броди", "Яготин", "Докучаєвськ", "Тростянець", "Волноваха",
        "Ладижин", "Яремче", "Красноград", "Червоний Лиман", "Скадовськ", "Гадяч", "Попасна", "Армянськ", "Полонне",
        "Кременець", "Болехів", "Сокаль", "Суходільськ"]

# Коробка передач
TRANSMISSIONS = ["Механічна", "Автоматична", "Варіатор", "Адаптивна", "Типтронік"]

# Стан авто
CONDITIONS = ["На ходу, технічно справна", "Не бита", "Не фарбована", "Гаражне зберігання",
              "Перший власник", "Сервісна книжка", "Потребує кузовного ремонту",
              "Потребує ремонту ходової", "Потребує ремонту двигуна", "Після ДТП", "Не на ходу"]

# Тип палива
FUELS = ["Бензин", "Дизель", "Газ/бензин", "Електро", "Гібрид", "Інший"]

# Тип приводу
TYPE_OF_DRIVE = ["Повний", "Передній", "Задній"]

# Тип авто
TYPE_CAR = ["Кабріолет", "Пікап", "Купе", "Унiверсал", "Хетчбек",
            "Мінівен", "Позашляховик", "Кроссовер", "Седан",
            "Інший", "Легковий фургон", "Ліфтбек", "Лімузин"]

# Кольори
COLORS = ["Чорний", "Cиній", "Сірий", "Сріблястий", "Червоний", "Зелений", "Апельсин", "Асфальт", "Бежевий",
          "Бірюзовий", "Бронзовий", "Вишневий", "Блакитний", "Жовтий", "Золотий", "Коричневий", "Магнолії",
          "Матовий", "Оливковий", "Рожевий", "Сафарі", "Фіолетовий", "Хамелеон"]

# Бренди авто
BRANDS = ["AC", "Acura", "Alfa Romeo", "Alpina", "Alpine", "Aro", "Asia", "Aston Martin", "Audi", "Austin",
          "BAW", "Beijing", "Bentley", "BMW", "Brilliance", "Bristol", "Bugatti", "Buick", "BYD", "Богдан",
          "Vector", "Venturi", "Volkswagen", "Volvo", "Vortex", "Wartburg", "Westfield", "Wiesmann", "Wuling",
          "ВАЗ", "Lada", "Geely", "Geo", "GMC", "Great Wall", "ГАЗ", "Dacia", "Dadi", "Daewoo", "Daihatsu",
          "Daimler", "Dallas", "Derways", "De Tomaso", "Dodge", "Dong Feng", "Doninvest", "Jeep", "Jiangling",
          "Jiangnan", "Eagle", "Zastava", "ZX", "ЗАЗ", "ЗИЛ", "Infiniti", "Innocenti", "Invicta", "Iran Khodro",
          "Isdera", "Isuzu", "IVECO", "Xin Kai", "ИЖ", "Cadillac", "Callaway", "Carbodies", "Caterham",
          "Citroen", "Cizeta", "Coggiola", "Kia", "Koenigsegg", "Qvale", "КАМАЗ", "Lamborghini", "Lancia",
          "Land Rover", "Landwind", "Lexus", "Lifan", "Lincoln", "Lotus", "LTI", "Luxgen", "ЛуАЗ", "Mahindra",
          "Marcos", "Marlin", "Marussia", "Maruti", "Maserati", "Maybach", "Mazda", "McLaren", "Mega",
          "Mercedes-Benz", "Mercury", "Metrocab", "MG", "Minelli", "Mini", "Mitsubishi", "Mitsuoka",
          "Monte Carlo", "Morgan", "Москвич", "Nissan", "Noble", "Oldsmobile", "Opel", "Pagani", "Panoz",
          "Paykan", "Perodua", "Peugeot", "Plymouth", "Pontiac", "Porsche", "Premier", "Proton", "Puma",
          "Reliant", "Renault", "Rolls-Royce", "Ronart", "Rover", "Ravon", "Saab", "Saleen", "Samsung",
          "Saturn", "Scion", "SEAT", "Skoda", "SMA", "Smart", "Soueast", "Spectre", "SsangYong", "Subaru",
          "Suzuki", "СеАЗ", "Talbot", "Tata", "Tatra", "Tianma", "Tofas", "Toyota", "Trabant", "TVR",
          "ТагАЗ", "УАЗ", "FAW", "Ferrari", "Fiat", "Ford", "FSO", "Fuqi", "Hafei", "Haima", "Hindustan",
          "Holden", "Honda", "HuangHai", "Hummer", "Hyundai", "Haval", "Chana", "ChangFeng", "Changhe",
          "Chery", "Chevrolet", "Chrysler", "Shifeng", "ShuangHuan", "JAC", "Jaguar"]
