# 50. Напишіть програму, яка зможе підрахувати слова у введеному рядку,
# розділені пропуском і вивести отриману статистику: для кожного унікального
# слова обчислити число його повторень (без урахування регістру), слова не
# повинні повторюватися, порядок слів довільний.
# Наприклад
# Дано
# a bb acD bb abc ac BCD a
# Вводимо дані та перевод у нижній регістр
text = input("Текст: ").lower()
# Робимо список через спліт
text = text.split(" ")
# Робимо множину бо у неї немає повторень
text_set = set(text)
# Та перебираемо
for elem in text_set:
    # текст.count - рахуемо слова
    print(elem, text.count(elem))

# print(text)
# print(text_set)
# Вивід
# a 2
# bb 2
# acd 1
# abc 1
# ac 1
# bcd 1