# 67 .Дано список словників. Кожен словник має 2 пари елементів: ключ name і
# значення імені студента, ключ points і значення – список балів з різних дисциплін
# (цілі двоцифрові числа). Надрукуйте найменші значення балів, отримані кожним
# студентом, в один рядок з пропуском.
# Наприклад
# Вхідні дані:
# Потрібно ввести список словників
# Вихідні дані:
# 45 60 30 49

# Створюємо початковий елемент як зразок в списку
# СЛОВНИК - {Ключ : Значення}
# СПИСОК - [Значення]
list_dict = [ { "name": "Журко", "points": [15, 12, 13, 24, 55] } ]

# Бескінечний цикл
while True:
    # додаємо елемент до нашого списку
    #  input("Оцінки через кому:") - вводимо
    #  .replace(" ", "") - замінюємо пробіли на нічого
    #  .split(",") - створюємо список із елементів що через кому (ріжемо)
    #  append - додавання в список
    list_dict.append( {"name": "Значення ім'я", "points": input("Оцінки через кому:").replace(" ", "").split(",")} )
    # проста перевірка для виходу
    if "0" == input("Вийти? 0 - так > "):
        # вийти з While
        break

# перебираемо усі наші словники з списку з словниками
for elem in list_dict:
    # друкуємо
    # min() - мінімальне значення
    # elem - наш словник зі списку
    # .get("points") - ключ словника до списку з оцінками
    # разом усе знаходить найменший елемент
    print(min(elem.get("points")), end=" ")
